{
    "title": "The Arctic Code Vault?",
    "paragraphs": [
        "Alright ladies and gentlemen, time for a post about tech. I’m currently a senior computer science student at the University of Pittsburgh, and akin to pretty much any other computer science student or professional software engineer, I use a platform called Github. If you’re not familiar with Github, “Github is a code hosting platform for version control and collaboration. It lets you and others work together on projects from anywhere.” To simply put it, Github allows programmers to collaboratively work together on projects in a neat and efficient way.",
        "Now, on to the more interesting part. (hopefully before I lose anyone) Github holds over 1.1 billion contributions from developers across the world. That’s a lot of contributions, and a hell of a lot of code. One of Github’s key initiatives is to provide a platform that enables users to provide open source code for millions of others to use and learn from.",
        "With Covid-19 and the global pandemic still in full swing it might feel like the world is ending, but imagine a scenario in which a global catastrophe were to actually occur. This is essentially a situation in which Github imagined, and is one of the reasons they decided to create the “Arctic Code Vault.” ",
        "Github’s Arctic Code Vault is a “data repository preserved in the Arctic World Archive, a long-term archival facility 250 meters deep in the permafrost of an Arctic mountain.” The archive is actually inside of a decommissioned coal mine close to the North Pole, and is intended to last for hundreds of years to come.",
        "If you think this sounds a bit crazy, you’re not alone. However, Github isn’t the first to store data inside of a repository in the arctic permafrost. As mentioned before, Github paired with the AWA (Arctic World Archive) in order to make the Arctic Code Vault a possibility. The AWA is an organization founded in 2017 that “holds an impressive collection of valuable digital artefacts and irreplaceable information from around the world.” The AWA already stores things like manuscripts from the Vatican Library, various scientific breakthroughs, and masterpieces from artists like Rembrandt and Munch. Their mission is to store data in “the safest location on Earth,” a place capable of withstanding both natural and man-made disasters.",
        "So that’s pretty cool and all, but how is github intending to store such a large amount of digital information inside of a very physical place? For starters, github took a snapshot of each repository’s most recent version. From there they compressed the data and encoded it into a QR-code. They also included a human-readable index that explains how to recover the data on each data reel. Overall, the data snapshot which was taken on February 2nd of 2020 contains 21TB of data, and fits onto 186 reels of film. ",
        "In my opinion, one of the coolest things about the Arctic Code Vault is how wide-reaching the code vault extends. The repository contains every Github repo with any commits between the original announcement of the vault to February 2nd. Additionally, every repo with at least one star and any commits from prior years were included, along with any existing repo at all that had at least 250 stars. What that means for any of the Github users reading this is that you probably have code currently residing somewhere in the arctic permafrost. In fact you don’t even have to make an assumption of your potential contribution to the code vault. Github has created a badge that appears on your profile as an “Arctic Code Vault Contributor,” and well, I think that’s pretty nifty. ",
        "Github’s initiative creates an interesting conversation regarding long-term storage of digital information. I’ve personally never thought about the physical storage of electronic data, and I especially never imagined that the physical manifestation of this data would be stored somewhere deep in an old coal mine in the arctic. I’m curious to see how this will affect other companies and organizations moving forward, and I’m also curious to see what kind of data we deem “worthy” of protecting like this in the future.",
        "If you’d like to learn more details about the Arctic Code Vault or the Arctic World Archive I’d suggest visiting their respective websites linked here: ",
        "https://archiveprogram.github.com/arctic-vault/",
        "https://arcticworldarchive.org/ "
    ]
}