{
    "title": "Cooking, even if you’re an idiot?",
    "paragraphs": [
        "Time to talk about food, something virtually everyone is a fan of. Even if you’re a picky eater or have dietary restrictions I’m sure there’s at least some type of food you can get excited about. What I find confusing is while seemingly everyone loves to eat, there aren’t nearly as many people who love to cook, or even really claim to “know” how to cook. I’ll be the first to admit, as a college kid I may have a bit of bias in regards to the general population’s cooking knowledge. I’ve seen plenty of college diets consisting of solely frozen foods and instant ramen. However, I still think there’s something to be said about cooking. ",
        "Growing up my parents, and more specifically my mom, did pretty much all of the cooking in our family. Thanks mom! However, my opinion is that cooking is a basic human skill; we should all know how to do it. While I’m not suggesting that you start baking a souffle at 3 years old (though if you can do that, more power to you), it might at least help you to know how to scramble eggs by the time you’re 20. Hopefully I don’t sound too patronizing so far, you certainly won’t be seeing me on Iron Chef anytime soon. However, I do believe that absolutely anyone is capable of cooking, Bobby Flay or not.",
        "This year I decided to put together Christmas dinner for my family. I planned out everything I wanted to make, went shopping for the ingredients, and with the help of my mom playing sous chef, (thanks again mom!) made a pretty decent Christmas dinner consisting mainly of italian foods. Chicken cacciatore, italian wedding soup, and a vegetable lasagna were the main things we made, and for the first time making all of those dishes, it turned out pretty well! The point of talking about everything I made really isn’t to brag, but instead mention how I went about cooking everything- using online recipes. ",
        "At the end of the day that’s how easy it is, looking up what you’d like to make online, obtaining the ingredients, and reading the instructions until you get your end product. I’m under the impression that if you know how to read then you know how to cook. The process really isn’t all that intimidating, and in due time you might even feel like experimenting with your own recipes after gaining some experience in the kitchen. ",
        "Why learn how to cook though when you can easily pick up the phone and order takeout in half the time? Well, I think most people know the answer to that, so instead of answering the question directly I’m going to opt to share some numbers that you may find to be more interesting.",
        "Let’s talk money. The average “commercially-prepared” meal will cost you about $13, while the average home-cooked meal will bring you to around $4. That’s $9 dollars you’re saving each time you decide to cook at home, and you can multiply that if you’re cooking for others as well. On a more drastic note, cooking dinner at home every day compared to eating out for dinner could save you over $3,000 a year. That’s a bit extreme, so let’s say you eat out for dinner once every Friday night. If you only decide to eat out half as much the next year you could be saving over $200 on dinners alone. ",
        "However, let’s say money isn’t an issue (good for you!). A study by Public Health Nutrition states that “adults who cooked dinner at home only once a week consumed 2,300 calories per day on average, including 84 grams of fat and 135 grams of sugar. In comparison, regular at-home cooks ate 150 fewer calories per day and consumed only 81 grams of fat and 119 grams of sugar.” I’ve always found myself to be a “numbers guy,” but there’s plenty of ways to put those numbers into words. One way is to say that cooking at home could give you a better chance at avoiding things like weight gain, heart disease, and diabetes. ",
        "In conclusion, you can cook. Even if you’re an idiot! More importantly, you should cook. Whether you’re 17 or 83, there’s plenty to be gained from it, and at the very least maybe you can look cool, or just straight up pretend to be Bobby Flay. And hey, if I convinced you to start cooking and you do end up becoming the next Bobby Flay, maybe think about giving me a shout out on your Iron Chef debut episode."
    ]
}