{
    "title": "Another bs productivity hack?",
    "paragraphs": [
        "Well, 2020 is just about over, and what a year it’s been. However outrageous and unusual the year was, I’m sure there’ll be consistency in the tradition of the New Year’s resolution. If you’re not from America or another place that takes part in this tradition, or if you’ve just been living under a rock for awhile (admittedly not a terrible time to do so), the New Year’s resolution is essentially a tradition where someone picks some aspect of their life in which they hope to better themselves, and then proceeds to better themselves in said aspect for about 2 weeks before ditching it entirely. If you’d like to get ahead of the curve for 2021 I’d suggest pre-ordering a set of dumbbells or other workout equipment, and then promptly storing it in a closet so that you never touch it again.",
        "Obviously the above paragraph was a joke, but if you’re someone who legitimately makes and then proceeds to effectively follow your New Year’s Resolution, then congratulations to you. In reality, I feel as if it’s a bit healthier to constantly be setting different goals regardless of the time of year, but if the New Year helps you start your goal-setting journey then I say go for it. Regardless, I always find the slew of self-help and productivity articles popping up at this time to be pretty dry and repetitive. ",
        "In the holiday spirit, I’ve decided to write my very own dry and repetitive productivity article, and I hope it gives you a renewed sense of motivation for like 30 minutes, just like all the other ones. In all seriousness, I do believe self-help/productivity articles and books can effectively motivate and inspire, I’m just merely referencing the tacky articles you might be seeing a lot of at this time of year. ",
        "While I’m nowhere remotely close to being an expert on the matter, I’d like to share one small thing I’ve noticed over the course of my life that has greatly influenced my productivity and personal accomplishments. The cool thing about my tip, is that it’s something you can let other people do for you. Simply put, my one tip is to encourage you to surround yourself with friends and coworkers that inspire you. ",
        "I’ll admit it, it’s definitely a tough time if you’re looking to “surround” yourself with people, but luckily you have plenty of ways for digital communication these days. From my personal experience, I’ve always found that I’m at my personal best when I’m surrounded by people that are also doing their best. ",
        "The first time I ever noticed how much of an impact other people had on my productivity was in High School. I’ve been extremely lucky to have been surrounded with such incredible friends; people that I enjoy the presence of, and people that do some absolutely amazing things, in turn, inspiring me to achieve somewhat equally as amazing things. At just a single point in time, I’ve had friends that blew me away with their academic prowess, musical skill, and straight up physical achievement. Along the way they’ve motivated me to practice harder, study more, think creatively, and even exercise more. I can’t claim that any of my accomplishments were based solely off of my own skill or expertise, and I can’t stress enough how important it’s been to find people that strive to inspire. ",
        "This foundation of friends and colleagues has been so monumentally important to me even as I progressed past High School, as it enabled me to find equally as awesome and inspiring people in college and in a professional environment. One of the coolest parts about this process is that the entire thing is like a feedback loop. You become inspired and motivated through your peers, and in turn other people can become inspired and motivated by you.",
        "It turns out that this tip can even be confirmed through science! In economics and sociology there’s something called the “Social Multiplier Effect.” This effect is used to describe a principle that states that “high levels of one attribute amongst one’s peers can have spillover effects on an individual.” Essentially what that means is that strong traits and qualities of people you spend lots of time with will rub off on you to some extent. The effect is applicable in just about any way from general health, fitness, education, and just about any other discipline you could think of. The SME even goes as far to say that, “if a poorly educated individual moves into a highly educated area they will experience some of the positive health effects associated with being more educated.”",
        "In conclusion, the people you spend time with are incredibly important. Not just for your social life but your professional life as well. It could very well be that I’m speaking the obvious through writing this, but a reminder can’t ever hurt. At the very least I got to give a bit of a shout out to my awesome friends, but hopefully you can find something of value from this post. As we head into 2021 I wish everyone the best in their future endeavors and goals, whether they’re ones you’ve set this New Year, or not."
    ]
}