{
	"title": "The Ideal Body?",
	"paragraphs": [
        "I’m a 21 year old male. I’m 6 feet tall, and I weigh 160 pounds. Some might consider my age to be at or near my physical prime. At this point, I could be the “most attractive” I’ll ever be, but what does that really mean? ",
        "To answer the question, not much. Something that I always thought to be one of the coolest possibilities about the human body is that we have the power to change it. Want to drop a few pounds? You can do that. Want to pack on some muscle? You can also do that. Change the color of your hair? Sure thing. On a more extreme note we could even surgically modify different aspects of the way we look. What’s even more amazing is that we don’t need to do any of those things at all. There’s also the possibility to be content with the way we look. The unfortunate thing is that most people aren’t so happy with the way they look, but why is that?",
        "Well the issue in its entirety is pretty complex, and I’m nowhere near an expert on the matter. Simply put, the media puts a lot of pressure on society to look and act a certain way. ",
        "For me, that pressure feels a lot like needing to put on a few extra pounds. Ever since I can remember I’ve always been a pretty skinny kid. I can look back at pictures from elementary school to present day, and in all of them, I’m pretty skinny. One of the interesting things is that it never really mattered to me until around High School. Why the change in mindset happened, I can’t say for sure, and it’s likely that a lot of different reasons contributed to it. In hindsight, it turns out that I’m pretty lucky. According to the Melrose Center, (facilities that specialize in treating eating disorders) by the age of 10, 80% of kids are already concerned with being “too fat.” Additionally, problems are worse with women, and at age 17, they find that 78% of girls are unhappy with their bodies. ",
		"There are plenty of other scary statistics worth noting, but I feel as if those alone get across the point. I wish I could provide a solution to some of these problems, but as I’ve mentioned before, I’m no expert on the subject. Instead, what I’d like to talk about is an interesting article that I came across recently. ",
		"The article entitled, “Women overestimate men’s attraction to thin female fashion models” unsurprisingly, talks about how women overestimate men’s attraction to the media’s idea of the “ideal female body.” Essentially, the article takes you through a few studies where people “rate” female model’s bodies, and then proceed to estimate how the other gender rated the models. As suggested in the title, the study found that females thought that males would rate the model’s bodies more favorably than they actually did. In conclusion, the authors figured that the study could be used to “lessen the negative impact of unhealthy beauty standards.” ",
		"I think that the article can raise a pretty interesting discussion regarding society’s “ideal body image” for both men and women. It almost begs the question, “who are fashion models presenting to?” A question with a simple answer, but until reading the article, I’ve never personally thought much about it at all. ",
		"Female models present themselves to a female base of customers and likewise for males and male models. Victoria’s secret might as well be the fact that their models are geared towards women rather than men. Men aren’t typically in the market for bras and lingerie, and because of that their models have no need to appeal directly to them. The fashion models for women’s fashion companies like Victoria’s Secret advertise specifically to their female customers. The same can be said about male models in the fashion industry. The reality for men is that male bodybuilders and other models appeal more to men than they do to females.",
		"That’s not to say that men aren’t attracted to the skinny fashion models in magazines, or that women don’t like the ripped guys you can find selling you protein powder on facebook. What it’s really saying is that the importance we put on ourselves to look this way may be much more a product of the media and advertisement than the standards of those we aim to attract.",
		"Do I think that this mindset can put an end to body image issues as a whole? Absolutely not, but I think that it’s worth noting, and definitely something interesting to think about. In a way it’s comforting to think that we’re the ones putting extra pressure on ourselves to look a certain way, rather than thinking we need to look a certain way to be deemed attractive by someone else. I’d like to believe that getting a better understanding of the why and how behind the body standards portrayed in the media can be a small nudge in the right direction of being comfortable in our own skin. After all, it’s the little things that can lead to big changes."
	]
}